// Base Addres of DMAMUX_OVR = 0x40020800

#define STM32G431_DMAMUX_OVR_C0CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C0CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C0CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C0CR;

#define STM32G431_DMAMUX_OVR_C1CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C1CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C1CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C1CR;

#define STM32G431_DMAMUX_OVR_C2CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C2CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C2CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C2CR;

#define STM32G431_DMAMUX_OVR_C3CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C3CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C3CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C3CR;

#define STM32G431_DMAMUX_OVR_C4CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C4CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C4CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C4CR;

#define STM32G431_DMAMUX_OVR_C5CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C5CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C5CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C5CR;

#define STM32G431_DMAMUX_OVR_C6CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C6CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C6CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C6CR;

#define STM32G431_DMAMUX_OVR_C7CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C7CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C7CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C7CR;

#define STM32G431_DMAMUX_OVR_C8CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C8CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C8CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C8CR;

#define STM32G431_DMAMUX_OVR_C9CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C9CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C9CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C9CR;

#define STM32G431_DMAMUX_OVR_C10CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C10CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C10CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C10CR;

#define STM32G431_DMAMUX_OVR_C11CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C11CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C11CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C11CR;

#define STM32G431_DMAMUX_OVR_C12CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C12CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C12CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C12CR;

#define STM32G431_DMAMUX_OVR_C13CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C13CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C13CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C13CR;

#define STM32G431_DMAMUX_OVR_C14CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C14CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C14CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C14CR;

#define STM32G431_DMAMUX_OVR_C15CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DMAREQ_ID : 7;
    unsigned long Res0 : 1;
    unsigned long SOIE : 1;
    unsigned long EGE : 1;
    unsigned long Res1 : 6;
    unsigned long SE : 1;
    unsigned long SPOL : 2;
    unsigned long NBREQ : 5;
    unsigned long SYNC_ID : 5;
    unsigned long Res2 : 3;
} sSTM32G431_DMAMUX_OVR_C15CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_C15CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_C15CR;

#define STM32G431_DMAMUX_OVR_RG0CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long SIG_ID : 5;
    unsigned long Res0 : 3;
    unsigned long OIE : 1;
    unsigned long Res1 : 7;
    unsigned long GE : 1;
    unsigned long GPOL : 2;
    unsigned long GNBREQ : 5;
    unsigned long Res2 : 8;
} sSTM32G431_DMAMUX_OVR_RG0CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_RG0CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_RG0CR;

#define STM32G431_DMAMUX_OVR_RG1CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long SIG_ID : 5;
    unsigned long Res0 : 3;
    unsigned long OIE : 1;
    unsigned long Res1 : 7;
    unsigned long GE : 1;
    unsigned long GPOL : 2;
    unsigned long GNBREQ : 5;
    unsigned long Res2 : 8;
} sSTM32G431_DMAMUX_OVR_RG1CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_RG1CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_RG1CR;

#define STM32G431_DMAMUX_OVR_RG2CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long SIG_ID : 5;
    unsigned long Res0 : 3;
    unsigned long OIE : 1;
    unsigned long Res1 : 7;
    unsigned long GE : 1;
    unsigned long GPOL : 2;
    unsigned long GNBREQ : 5;
    unsigned long Res2 : 8;
} sSTM32G431_DMAMUX_OVR_RG2CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_RG2CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_RG2CR;

#define STM32G431_DMAMUX_OVR_RG3CR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long SIG_ID : 5;
    unsigned long Res0 : 3;
    unsigned long OIE : 1;
    unsigned long Res1 : 7;
    unsigned long GE : 1;
    unsigned long GPOL : 2;
    unsigned long GNBREQ : 5;
    unsigned long Res2 : 8;
} sSTM32G431_DMAMUX_OVR_RG3CR;

typedef union {
    sSTM32G431_DMAMUX_OVR_RG3CR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_RG3CR;

#define STM32G431_DMAMUX_OVR_RGSR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long OF : 4;
    unsigned long Res0 : 28;
} sSTM32G431_DMAMUX_OVR_RGSR;

typedef union {
    sSTM32G431_DMAMUX_OVR_RGSR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_RGSR;

#define STM32G431_DMAMUX_OVR_RGCFR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long COF : 4;
    unsigned long Res0 : 28;
} sSTM32G431_DMAMUX_OVR_RGCFR;

typedef union {
    sSTM32G431_DMAMUX_OVR_RGCFR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_RGCFR;

#define STM32G431_DMAMUX_OVR_CSR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long SOF : 16;
    unsigned long Res0 : 16;
} sSTM32G431_DMAMUX_OVR_CSR;

typedef union {
    sSTM32G431_DMAMUX_OVR_CSR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_CSR;

#define STM32G431_DMAMUX_OVR_CFR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long CSOF : 16;
    unsigned long Res0 : 16;
} sSTM32G431_DMAMUX_OVR_CFR;

typedef union {
    sSTM32G431_DMAMUX_OVR_CFR Bit;
    unsigned long  All;
} uSTM32G431_DMAMUX_OVR_CFR;

typedef struct {
    uSTM32G431_DMAMUX_OVR_C0CR STM32G431_DMAMUX_OVR_C0CR; // Offset: 0x0
    uSTM32G431_DMAMUX_OVR_C1CR STM32G431_DMAMUX_OVR_C1CR; // Offset: 0x4
    uSTM32G431_DMAMUX_OVR_C2CR STM32G431_DMAMUX_OVR_C2CR; // Offset: 0x8
    uSTM32G431_DMAMUX_OVR_C3CR STM32G431_DMAMUX_OVR_C3CR; // Offset: 0xC
    uSTM32G431_DMAMUX_OVR_C4CR STM32G431_DMAMUX_OVR_C4CR; // Offset: 0x10
    uSTM32G431_DMAMUX_OVR_C5CR STM32G431_DMAMUX_OVR_C5CR; // Offset: 0x14
    unsigned long Reserved0;
    unsigned long Reserved1;
    uSTM32G431_DMAMUX_OVR_C6CR STM32G431_DMAMUX_OVR_C6CR; // Offset: 0x20
    uSTM32G431_DMAMUX_OVR_C7CR STM32G431_DMAMUX_OVR_C7CR; // Offset: 0x24
    uSTM32G431_DMAMUX_OVR_C8CR STM32G431_DMAMUX_OVR_C8CR; // Offset: 0x28
    uSTM32G431_DMAMUX_OVR_C9CR STM32G431_DMAMUX_OVR_C9CR; // Offset: 0x2C
    uSTM32G431_DMAMUX_OVR_C10CR STM32G431_DMAMUX_OVR_C10CR; // Offset: 0x30
    uSTM32G431_DMAMUX_OVR_C11CR STM32G431_DMAMUX_OVR_C11CR; // Offset: 0x34
    unsigned long Reserved2;
	unsigned long Reserved3;
	uSTM32G431_DMAMUX_OVR_CSR STM32G431_DMAMUX_OVR_CSR; // Offset: 0x80
	uSTM32G431_DMAMUX_OVR_CFR STM32G431_DMAMUX_OVR_CFR; // Offset: 0x84
	unsigned long Reserved4;
	unsigned long Reserved5;
	uSTM32G431_DMAMUX_OVR_RG0CR STM32G431_DMAMUX_OVR_RG0CR; // Offset: 0x100
    uSTM32G431_DMAMUX_OVR_RG1CR STM32G431_DMAMUX_OVR_RG1CR; // Offset: 0x104
    uSTM32G431_DMAMUX_OVR_RG2CR STM32G431_DMAMUX_OVR_RG2CR; // Offset: 0x108
    uSTM32G431_DMAMUX_OVR_RG3CR STM32G431_DMAMUX_OVR_RG3CR; // Offset: 0x10c
    unsigned long Reserved6;
	unsigned long Reserved7;
	uSTM32G431_DMAMUX_OVR_RGSR STM32G431_DMAMUX_OVR_RGSR; // Offset: 0x140
	uSTM32G431_DMAMUX_OVR_RGCFR STM32G431_DMAMUX_OVR_RGCFR; // Offset: 0x144


    unsigned long Reserved8;
    unsigned long Reserved9;
    unsigned long Reserved10;
    unsigned long Reserved11;
    unsigned long Reserved12;
    unsigned long Reserved13;
    unsigned long Reserved14;
    unsigned long Reserved15;
    unsigned long Reserved16;
    unsigned long Reserved17;
    unsigned long Reserved18;
    unsigned long Reserved19;
    unsigned long Reserved20;
    unsigned long Reserved21;
    unsigned long Reserved22;
    unsigned long Reserved23;
    unsigned long Reserved24;
    unsigned long Reserved25;
    unsigned long Reserved26;
    unsigned long Reserved27;
    unsigned long Reserved28;
    unsigned long Reserved29;
    unsigned long Reserved30;
    unsigned long Reserved31;
    unsigned long Reserved32;
    unsigned long Reserved33;
    unsigned long Reserved34;
    unsigned long Reserved35;
    unsigned long Reserved36;
    unsigned long Reserved37;
    unsigned long Reserved38;
    unsigned long Reserved39;
    unsigned long Reserved40;
    unsigned long Reserved41;
    unsigned long Reserved42;
    unsigned long Reserved43;
    unsigned long Reserved44;
    unsigned long Reserved45;
    unsigned long Reserved46;
    unsigned long Reserved47;

    unsigned long Reserved48;
    unsigned long Reserved49;
    unsigned long Reserved50;
    unsigned long Reserved51;
    unsigned long Reserved52;
    unsigned long Reserved53;
    unsigned long Reserved54;
    unsigned long Reserved55;
    unsigned long Reserved56;
    unsigned long Reserved57;
    unsigned long Reserved58;
    unsigned long Reserved59;


} sSTM32G431_DMAMUX_OVR;

